zhangruiyep/Embeded-nrf52832/examples/ble_peripheral/ble_app_uart/audio/es8374.c
/*
 * ESPRESSIF MIT License
 *
 * Copyright (c) 2018 <ESPRESSIF SYSTEMS (SHANGHAI) PTE LTD>
 *
 * Permission is hereby granted for use on all ESPRESSIF SYSTEMS products, in which case,
 * it is free of charge, to any person obtaining a copy of this software and associated
 * documentation files (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the Software is furnished
 * to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or
 * substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 */

//#include "esp_system.h"
//#include "esp_log.h"
//#include "driver/i2c.h"
#include "es8374.h"
//#include "board_pins_config.h"

/* nrf52832 port begin */
#include "nrf_log.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"

#define ESP_LOGE(TAG, ...) do {\
    NRF_LOG_ERROR(##__VA_ARGS__);\
}while(0)

#define ESP_LOGW(TAG, ...) do {\
    NRF_LOG_WARNING(##__VA_ARGS__);\
}while(0)

#define ESP_LOGI(TAG, ...) do {\
    NRF_LOG_INFO(##__VA_ARGS__);\
}while(0)

#define ESP_LOGD(TAG, ...) do {\
    NRF_LOG_DEBUG(##__VA_ARGS__);\
}while(0)

/* TWI instance ID. */
#define TWI_INSTANCE_ID     1

/* Indicates if operation on TWI has ended. */
static volatile bool m_xfer_done = false;

/* TWI instance. */
static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);

/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                //data_handler(m_sample);
            }
            m_xfer_done = true;
            break;
        default:
            break;
    }
}

/* nrf52832 port end */

#define ES8374_TAG "ES8374_DRIVER"

#define ES_ASSERT(a, format, b, ...) \
    if ((a) != 0) { \
        ESP_LOGE(ES8374_TAG, format, ##__VA_ARGS__); \
        return b;\
    }

#define LOG_8374(fmt, ...)   ESP_LOGW(ES8374_TAG, fmt, ##__VA_ARGS__)

static int codec_init_flag = 0;

#if 0
static i2c_config_t es_i2c_cfg = {
    .mode = I2C_MODE_MASTER,
    .sda_pullup_en = GPIO_PULLUP_ENABLE,
    .scl_pullup_en = GPIO_PULLUP_ENABLE,
    .master.clk_speed = 100000
};

audio_hal_func_t AUDIO_CODEC_ES8374_DEFAULT_HANDLE = {
    .audio_codec_initialize = es8374_codec_init,
    .audio_codec_deinitialize = es8374_codec_deinit,
    .audio_codec_ctrl = es8374_codec_ctrl_state,
    .audio_codec_config_iface = es8374_codec_config_i2s,
    .audio_codec_set_mute = es8374_set_voice_mute,
    .audio_codec_set_volume = es8374_codec_set_voice_volume,
    .audio_codec_get_volume = es8374_codec_get_voice_volume,
};
#endif

static bool es8374_codec_initialized()
{
    return codec_init_flag;
}

#if 0
int es_write_reg(uint8_t slaveAdd, uint8_t regAdd, uint8_t data)
{
    int res = 0;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    res |= i2c_master_start(cmd);
    res |= i2c_master_write_byte(cmd, slaveAdd, 1 /*ACK_CHECK_EN*/);
    res |= i2c_master_write_byte(cmd, regAdd, 1 /*ACK_CHECK_EN*/);
    res |= i2c_master_write_byte(cmd, data, 1 /*ACK_CHECK_EN*/);
    res |= i2c_master_stop(cmd);
    res |= i2c_master_cmd_begin(0, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);
    ES_ASSERT(res, "ESCodecWriteReg error", -1);
    return res;
}

int es_read_reg(uint8_t slaveAdd, uint8_t regAdd, uint8_t *pData)
{
    uint8_t data;
    int res = 0;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    res |= i2c_master_start(cmd);
    res |= i2c_master_write_byte(cmd, slaveAdd, 1 /*ACK_CHECK_EN*/);
    res |= i2c_master_write_byte(cmd, regAdd, 1 /*ACK_CHECK_EN*/);
    res |= i2c_master_stop(cmd);
    res |= i2c_master_cmd_begin(0, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);

    cmd = i2c_cmd_link_create();
    res |= i2c_master_start(cmd);
    res |= i2c_master_write_byte(cmd, slaveAdd | 0x01, 1 /*ACK_CHECK_EN*/);
    res |= i2c_master_read_byte(cmd, &data, 0x01/*NACK_VAL*/);
    res |= i2c_master_stop(cmd);
    res |= i2c_master_cmd_begin(0, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);

    ES_ASSERT(res, "Es8374ReadReg error", -1);
    *pData = data;
    return res;
}
#endif

static int i2c_init()
{
#if 0
    int res;
    res = get_i2c_pins(I2C_NUM_0, &es_i2c_cfg);
    res = i2c_param_config(I2C_NUM_0, &es_i2c_cfg);
    res |= i2c_driver_install(I2C_NUM_0, es_i2c_cfg.mode, 0, 0, 0);
    ES_ASSERT(res, "i2c_init error", -1);
    return res;
#else
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_es8374_config = {
       .scl                = I2C_SCL_PIN,
       .sda                = I2C_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_es8374_config, twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);

    return (int)err_code;
#endif
}

esp_err_t es8374_write_reg(uint8_t regAdd, uint8_t data)
{
    ret_code_t err_code;
    
    uint8_t reg[2] = {regAdd, data};
    err_code = nrf_drv_twi_tx(&m_twi, ES8374_ADDR, reg, sizeof(reg), false);
    APP_ERROR_CHECK(err_code);
    while (m_xfer_done == false);

    return (esp_err_t)err_code;
}

esp_err_t es8374_read_reg(uint8_t regAdd, uint8_t *regv)
{
    ret_code_t err_code;
    uint8_t reg[1] = {regAdd};

